package com.saray.project.chapter2;

/**
 * Глава 2. Упражнение 2.
 * На основании примера HelloDate.java в этой главе напишите программу «Привет,
 * мир», которая просто выводит это сообщение. Программа будет содержать только
 * один метод (тот, который исполняется при запуске программы — main()). Не забудьте
 * объявить его статическим (static) и включите список аргументов, даже если вы не
 * будете его использовать.
 */

public class Task2 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
